#+TITLE: Haskell notes

** Lazy evaluation

*Lazy evaluation* means the following:

1. Evaluate only enough to match patterns and guards. For example:
   #+begin_src haskell
   (\c _ -> c) 0 undefined
   #+end_src

   #+RESULTS:
   : 0

   Here we won't evaluate ~undefined~ because it fits the hole.
2. Evaluate only enough to expose a lambda form (in expressions of the form ~func_expr arg~, ~func_expr~ must be evaluated until a lambda form is exposed; we say that we have reached a *weak head normal form*, WHNF). For example:
   #+begin_src haskell
   (id (\x -> x + 1)) 1
   #+end_src

   #+RESULTS:
   : 2

   Here we need to evaluate ~id~ until the lambda term is exposed.

There are exceptions:

1. Arithmetic is not lazily evaluated; when we need ~2*3+4*5~ we must evaluate ~2*3~ and ~4*5~ and then ~6+20~.
2. The types introduced with ~newtype~ only have one constructor and will not perform any evaluation when required to match:
   #+begin_src haskell
   newtype Foo = Foo Int
   case undefined of { Foo _ -> 42 }
   #+end_src

   #+RESULTS:
   : 42

   Here the expression is assumed to match; the hole is never requested to be evaluated, and therefore the above evaluates to ~42~ instead of a runtime error.

(An introduction to lazy evaluation with more in-depth examples is given in an article by Albert Lai, <https://www.vex.net/~trebla/haskell/lazy.xhtml>.)

Evaluated and unevaluated Haskell expressions are collectively called *thunks*. Although it is harmless to imagine that thunks contain literal Haskell text code, in reality there are several intermediate representations that occur, the most important being the /spineless tagless G-machine/; see <https://www.microsoft.com/en-us/research/wp-content/uploads/1992/04/spineless-tagless-gmachine.pdf>.

*** Sharing

Lazy evaluation also comes with *sharing*, which is an optimization that prevents expressions from being evaluated multiple times. The simplest example:

#+begin_src haskell
(\x -> (x, x)) expr
#+end_src

Sharing does not always happen; and sometimes it can cause memory usage to increase a lot. For example, if ~expr~ has to be shared in two different places that have a long time in between them being evaluated, then ~expr~ will linger in memory for that long. Not sharing can also cause time and memory usage by keeping two expressions in memory.

Sharing is supposed to be strictly an optimization. Haskell does not have side effects; i.e. even ~IO~ values are pure in that sense. Remember that doing

#+begin_src haskell
(\x -> (x, x)) (putStrLn "Hello")
#+end_src

does not mean that the ~putStrLn~ expression gets executed. Another example that does not print anything:

#+begin_src haskell
putStrLn "Hello" `seq` 42
#+end_src

#+RESULTS:
: 42

We can think of ~IO~ as building a bunch of assembly instructions, and ~putStrLn~ would be just an ~IO~ constructor, but actual execution happens by GHC when bootstrapping the special symbol ~main~ (or say, the REPL).

Nevertheless, primitives that cause side effects can be used to demonstrate sharing. For example, let's run the code below in the (unoptimized) GHCi REPL:

#+begin_src haskell
import Debug.Trace
let x = trace "x-thunk" 1 in (x, x)
#+end_src

#+RESULTS:
: (x-thunk 1,x-thunk 1)

On the other hand, with the following we will observe a different result:

#+begin_src haskell
import Debug.Trace
let x = trace "x-thunk" 1 :: Int in (x, x)
#+end_src

#+RESULTS:
: (x-thunk 1,1)

Nevertheless, both will produce the same result when compiled with GHC and executed as a program. The reason is that GHCi is unoptimized and lacks the [[https://wiki.haskell.org/GHC_optimisations][Common Subexpression Elimination]] optimization. The variable ~x~ can be shared when specified as an ~Int~ but if not, it is a ~Num a => a~ and it cannot (without optimizations) be determined to be the same thunk, so it is not shared. Whether CSE is applied or not is difficult to say; if one wishes to have it explicitly done, it must be done by hand, by using ~let x = ...~ and repeating ~x~ inside the body, but also /ensuring/ that the value of ~x~ is monomorphic with type annotations.

Thus ~Debug.Trace.trace~ can help us track down the sharing behavior if the need arises.

*** Multiple threads and black hole marks

When switching between threads, entered thunks are marked as *black holed*, that is, there is automatic protection that no two threads attempt to evaluate the same expression concurrently. See <https://simonmar.github.io/bib/papers/multiproc.pdf>. When a thread attempts to enter a black hole, it will wait until the other thread, responsible for putting the black hole in place, is finished with its evaluation. Black holing is not a perfect mutually exclusive lock; sometimes threads may end up doing redundant work.

Black Holing is also used to prevent loops when evaluating terms, even on a single thread:

#+begin_src haskell
let x = head [x] in x
#+end_src

#+RESULTS:
: Exception: <<loop>>.

The above code will cause a ~<<loop>>~ exception because a thunk attempts to re-enter a previously black holed thunk. However, this is not reliable, unlike the multiple thread situation above, and only detects a very specific infinite loop; nevertheless it is also implemented with black hole marks.

Note that there can be OS threads (handled by the *runtime system* (RTS) of the OS, i.e. the process/thread scheduler) or green threads (handled by GHC's RTS or programmer's RTS). Haskell comes with threaded RTS and single RTS; the former will use OS threads while the latter will use a single thread, but both will use Haskell's green threads.

Whether a thunk gets marked as a black hole on entry will depend on whether one opted for eager black holing or used the default lazy black holing; the details for that are in <https://gitlab.haskell.org/ghc/ghc/-/blob/wip/T17910/rts/Updates.h>.

Further details on the heap layout and black holes can be found here: <https://gitlab.haskell.org/ghc/ghc/-/wikis/commentary/rts/storage/heap-objects>.

*** A counter-example to the above intuition

An example monad that does not fit this intuition is the list monad. Note for example:

#+begin_src haskell
[1,2,3] >> [4,5]
#+end_src

#+RESULTS:
: [4, 5, 4, 5, 4, 5]

Thus the notions of state and output do not apply here. In general there is no intuition that can apply to all monads, and the best we can do is follow the interface of the ~Monad~ class:

#+begin_src haskell
class Applicative m => Monad m where
  return      :: a -> m a
  (>>=)       :: m a -> (a -> m b) -> m b
#+end_src

*** A simple counter

We can decrease by one with this state processor:

#+begin_src haskell
decrease :: State Int Int
decrease = do c <- get
              put $ c - 1
              pure c
#+end_src

Then we may create a new state processor that will count down 10 times and gather the results in a list:

#+begin_src haskell
s = sequence $ replicate 10 $ decrease
#+end_src

If we run this state processor we will get:

#+begin_src haskell
evalState s 100
#+end_src

#+RESULTS:
: [100, 99, 98, 97, 96, 95, 94, 93, 92, 91]

*** Core desugaring

When GHC compiles a Haskell program, after parsing into a syntax tree, it performs name resolution (replacing bound identifiers with unique, etc) and type checking, and then a process called *desugaring*, which produces /core/ output.

An example program such as:

#+begin_src haskell
example :: Int
example = length $ filter (== 'x') ['x', 'y', 'x']
#+end_src

#+RESULTS:
: 2

can be desugared (with optimizations ~-O1~ or without ~-O0~) using GHC:

#+begin_src sh
ghc -O0 -fforce-recomp \
    -ddump-ds -dno-typeable-binds \
    -dsuppress-idinfo -dsuppress-core-sizes Core.hs
#+end_src

Note that we may add the options ~-c -no-keep-hi-files -no-keep-o-files~ to avoid producing any intermediate files.

It will give us the GHC Core output:

#+begin_src
==================== Desugar (after optimization) ====================
Result size of Desugar (after optimization)
  = {terms: 25, types: 18, coercions: 0, joins: 0/2}

example :: Int
example
  = $ @GHC.Types.LiftedRep
      @[Char]
      @Int
      (length @[] Data.Foldable.$fFoldable[] @Char)
      (filter
         @Char
         (let {
            v_B1 :: Char -> Char -> Bool
            v_B1 = == @Char GHC.Classes.$fEqChar } in
          let {
            v_B3 :: Char
            v_B3 = GHC.Types.C# 'x'# } in
          \ (v_B2 :: Char) -> v_B1 v_B2 v_B3)
         (GHC.Types.:
            @Char
            (GHC.Types.C# 'x'#)
            (GHC.Types.:
               @Char
               (GHC.Types.C# 'y'#)
               (GHC.Types.: @Char (GHC.Types.C# 'x'#) (GHC.Types.[] @Char)))))
#+end_src

Here a few things are visible, such as the explicit instantiations of the polymorphic functions involved via ~Char~; the boxed character literal ~GHC.Types.C# 'x'#~, which one also obtain information using ~:info Char~ in the GHCi REPL, and even a /dictionary/ ~GHC.Classes.$fEqChar~, which is a runtime object that contains the implementations of the methods in the given type class. Note that this dictionary has a specialized (optimized) method for ~Char~ hence why it carries ~Char~ in its name. A user defined class ~MyProperty a~ might have a generic dictionary name, say called ~$fMyProperty~.

Now the output is not an actual language; it is merely a printable representation of the Core AST, and thus it may have its ambiguities (in print).

